Tekla Open API Reference for Tekla Structures 2025
MaterialSelectionForm Constructor (List<MaterialItem>, String)
 Creates a new instance of the MaterialSelectionForm, selecting the given material in the tree control.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public MaterialSelectionForm(
	List<MaterialItem> Materials,
	string Material
)
Public Sub New (
	Materials As List(Of MaterialItem),
	Material As String
)
Parameters
Materials
Type: System.Collections.Generic.List<MaterialItem>
The materials to be added to the dialog.
Material
Type: System.String
The material to be selected in the tree.
See Also
Reference
MaterialSelectionForm Class
MaterialSelectionForm Overload
Tekla.Structures.Dialog.UIControls Namespace